console.log('Lazy load')
console.log('loading="lazy" В розмітку html в властивості для фото потрібно додавати loading="lazy" - ця властивість автоматично підтримується браузером. Фото будуть загружатьсь тільки ті, які є області відимості користувача. при скролі вниз/вверх будуть автоматично загружатись інші фото,які попадають на єкран. дана властивість допомагає екномити память')

const lazyImages = document.querySelectorAll('img[loading="lazy"]');

lazyImages.forEach(image => {
    image.addEventListener('load', onImageLoaded, {once: true});  // перебрати масив forEach і на кожен повісити слухача подій
});

function onImageLoaded(evt) {
    console.log(onImageLoaded);
    evt.target.classList.add('appear'); // в момент, коли фото загружаються поставили йому додавання класу .feed img.appear , на якій анімація
};

// в момент, коли фото загружаються поставили йому додавання класу .feed img.appear , на якій анімація
// анімація відпрацьовує тому що у нас прописана властивість для img loading="lazy"
console.log('once')

// У слухача подій можемо передавати 3 події: на що спрацбовувати, функцію, як спрацьовувати і додаткові настройки.
// В ці настройки можемо передати властивість "once" скільки разів ми хочемо прослухати подію.add
// В нашому випадку ми хочемо прослухати раз, тобто, після того як загрузились всі картинки то більше не слухати. 
// image.addEventListener('load', onImageLoaded, {once: true}); - добавили 3-м аргументом